

#include "ADC.h"






/********************************************************************
* 	Инициализация АЦП
*********************************************************************/


void Init_ADC(void) // Настройка АЦП
{
	ADMUX &=~(1 << REFS1); //  берется напряжение питания
	ADMUX &=~(1 << REFS0); //  берется напряжение питания
	ADMUX &=~(1 << MUX0); //  MUX0 0000 -канал ADC0	
	ADMUX &=~(1 << MUX1); //  MUX1 0000 -канал ADC0	
	ADMUX &=~(1 << MUX2); //  MUX2 0000 -канал ADC0	
	ADMUX &=~(1 << MUX3); //  MUX3 0000 -канал ADC0	
	ADMUX &=~(1 << MUX4); //  MUX3 0000 -канал ADC0
	
	ADCSRA |=(1 << ADEN);  // Разрешение АЦП
	ADCSRA |=(1 << ADPS2)|(1 << ADPS1)|(1<<ADPS0);// Предделитель на 128 (частота АЦП 64kHz)		
	ADCSRA |=(1 << ADATE);  // Непрерывный режим работы АЦП
	//ADCSRA |=(1 << ADIE); // Разрешение прерывания от АЦП	
	ADCSRA |=(1 << ADSC);  // Запуск преобразования
				 
		

}
