#include "TIMER.h"



/********************************************************************
* 	Инициализация таймера
*********************************************************************/
void Init_TIMER0_COMP(void)
{
	//=========================================================
	//  Т А Й М Е Р  Т0	 (Циклический отсчет 10 ms)
	//	Режим CTC	WGM01=1, WGM00=0;
	//	(1/8.000.000)*1024=0.000128
	//	0.001 sec/0.000128=7,8 тактов в 1ms - #define COUNT_TIMER 8 или 79 тактов в 10mc
	//	
	//=========================================================
//			  7       6       5       4       3      2        1	
//	TCCR0 = FOC00 | WGM00 | COM01 | COM00 | CS02 | CS01 |	CS00

	//CS02,CS01,CS00 ПРЕСКАЛЕР 101 -1024; 001 -0; 010 -8; 011 -64; 100 -256
	//(1<<WGM01) | (0<<WGM00) CTC РЕЖИМ
	TCCR0 |=(0<<CS02)|(0<<CS01)|(1<<CS00)|(1<<WGM01)|(0<<WGM00);  	
																			


//TIMSK 
	//; TOIE01- РАЗРЕШАЕТ ПРЕРЫВАНИЕ ПО ПЕРЕПОЛНЕНИЮ, 0- ЗАПРЕЩАЕТ / OCIE0 1- РАЗРЕШАЕТ ПРЕРЫВАНИЕ ПО СОВПАДЕНИЮ, 0- ЗАПРЕЩАЕТ
	TIMSK |=(0<<TOIE0)|(1<<OCIE0); 
	
    TIFR |= (1<<OCF0)|(0<<TOV0);
}

